#!/usr/bin/env python3
# -*- coding: utf-8 -*-
"""
Created on Mon Dec 11 18:57:26 2017

@author: huasheng
"""

#price = ['价格', '价钱']
#quality = ['性价比', '补水', '效果', '东西', '宝贝', '产品', '喷雾', '正品', '质量', '生产日期', '保湿', '吸收', '包裹', '包装', '扭曲']
#express = ['发货', '物流', '速度', '快递', '送货']
#customer_service = ['客服', '服务态度', '态度', '人', '服务', '回复']
#更,更加 格外 挺 非常,特别,相当,十分, 好, 很, 甚, 颇, 异常, 蛮, 多么, 尤其,无比, 真的  1.5
#比较,较, 有点, 不太, 不大,不很  1.2
#稍微,稍稍,略为,多少,0.8
#太,极其,极度,过于,至  2
#不 -1

adverb_score = {'更':1.5, '更加':1.5, '格外':1.5, '挺':1.5, '非常':1.5, '特别':1.5, '相当':1.5, '十分':1.5, '好':1.5, '真的':1.5, '很':1.5, '甚':1.5, '颇':1.5, '异常':1.5, '蛮':1.5, '多么':1.5, '尤其':1.5, '无比':1.5, '真的':1.5, '比较':1.2, '较':1.2, '有点':1.2, '不太':1.2, '不大':1.2, '不很':1.2, '稍微':0.8, '稍稍':0.8, '略为':0.8, '多少':0.8, '太':2, '极其':2, '极度':2, '过于':2, '至':2, '不':-1}
adj_score = {'price':{}, 'quality':{}, 'express':{}, 'customer_service':{}}
adj_score['price'] = {'价格':{'好':1.0, '平常':0.5, '不错':1.2, '便宜':1.8, '合适':0.8, '低':1.5}}
adj_score['quality'] = {'性价比':{}, '补水':{}, '效果':{}, '东西':{}, '宝贝':{}, \
                         '产品':{}, '喷雾':{}, '正品':{}, '质量':{}, '生产日期':{}, \
                         '保湿':{}, '吸收':{}, '包裹':{}, '包装':{}, '扭曲':{}}
adj_score['express'] = {'发货':{}, '物流':{}, '速度':{}, '快递':{}, '送货':{}}
adj_score['customer_service'] = {'客服':{}, '服务态度':{}, '态度':{}, '人':{}, '服务':{}, '回复':{}}
adj_score['quality']['东西'] = {'好':1.0, '不错':1.2, '便宜':1.8}
adj_score['quality']['产品'] = {'好':1.0, '棒':1.8}
adj_score['quality']['保湿'] = {'好':1.0, '不错':1.2, '舒服':1.2}
adj_score['quality']['包装'] = {'好':1.2, '严密':1.2, '很严':1.5, '精致':1.5, '正规':1.2, '不错':1.0, '仔细':1.2, '完好':1.0, '完整':1.0, '严实':1.2}
adj_score['quality']['包裹'] = {'严实':1.2}
adj_score['quality']['吸收'] = {'好':1.0, '快':1.0, '不错':1.2}
adj_score['quality']['喷雾'] = {'好':1.0, '很密':1.5, '很细':1.5, '细密':1.5, '很柔':1.5, '不错':1.2, '蛮好':1.2, '均匀':1.2, '挺细':1.5, '细':1.5, '蛮细':1.5, '湿':1.0, '舒缓':1.0, '很棒':1.5, '很大':1.0, '细腻':1.0}
adj_score['quality']['宝贝'] = {'好':1.0, '不错':1.2, '很大':1.2}
adj_score['quality']['性价比'] = {'高':1.5, '不错':1.2}
adj_score['quality']['扭曲'] = {'严重':-1.5}
adj_score['quality']['效果'] = {'好':1.0, '很好':1.5, '不错':1.2, '一般':0.5, '挺好':1.2, '明显':1.0}
adj_score['quality']['正品'] = {'好':1.0}
adj_score['quality']['生产日期'] = {'早':-1.0}
adj_score['quality']['补水'] = {'好':1.0, '不错':1.2, '很棒':1.8}
adj_score['quality']['质量'] = {'好':1.0, '不错':1.2}
adj_score['express']['发货'] = {'好':1.0, '快':1.5, '蛮快':1.2, '慢':-1.5}
adj_score['express']['快递'] = {'慢':-1.5}
adj_score['express']['物流'] = {'太慢':-2.0, '慢':-1.5, '快':1.5, '差':-2.0, '迅速':2.0, '较慢':-1.2}
adj_score['express']['送货'] = {'快':1.5}
adj_score['express']['速度'] = {'好':1.0, '快':1.5}
adj_score['customer_service']['人'] = {'好':1.0}
adj_score['customer_service']['回复'] = {'快':1.0}
adj_score['customer_service']['客服'] = {'好':1.0, '认真':1.5}
adj_score['customer_service']['态度'] = {'好':1.2, '不错':1.0}
adj_score['customer_service']['服务'] = {'好':1.0, '不错':1.2, '差':-2.0}
adj_score['customer_service']['服务态度'] = {'好':1.2, '不错':1.0}











